app/controllers/employee_expenses_controller.rb

  def index
    @data_imports = EmployeeExpense.all
---
SELECT "employee_expenses".* FROM "employee_expenses"