app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses"   ORDER BY transaction_date asc
---
	def show_by_month
		@months = Expense.all.order('transaction_date asc').group_by{ |e| e.transaction_date.beginning_of_month }